import React from "react";

const Accounts = () => {
  return (
    <div className="p-5 h-[calc(200vh-200px)] dark:bg-[#1E2939] dark:border-2 dark:border-white overflow-y-auto space-y-4">
      <h2 className="text-center font-semibold text-3xl">
        মন্দিরের ইতিহাস : রামপুর আখিরা পাড়া হরিমন্দির
      </h2>
      <p>
        মন্দিরের ইতিহাসের এই নিবন্ধে আমরা রামপুর আখিরা পাড়া হরিমন্দিরের
        প্রতিষ্ঠা, উদ্দেশ্য এবং ধর্মীয় কার্যক্রম সম্পর্কে আলোচনা করব। ১৯৮৫ সালে
        প্রতিষ্ঠিত এই মন্দির স্থানীয় ভক্তসমাজের সম্মিলিত উদ্যোগে গঠিত হয়েছে
        এবং এটি মহানাম সংকীর্তন ও যজ্ঞের মাধ্যমে ভগবানের সেবা ও সাধনার উদ্দেশ্যে
        নির্মিত হয়েছে। এই পবিত্র স্থানটি ধর্মীয় ও আধ্যাত্মিক সংস্কৃতির একটি
        উজ্জ্বল নিদর্শন হিসেবে পরিচিত।
      </p>
      <img src="https://i.ibb.co/LzqLqQnb/visual-selection.png" alt="#" />
      <h2 className="text-2xl font-semibold">মন্দিরের পরিচিতি</h2>
      <ul>
        {" "}
        <li>1. মন্দিরের নাম: রামপুর আখিরা পাড়া হরিমন্দির </li>
        <li>2. ঠিকানা: রামপুর, কাহারোল, দিনাজপুর | </li>
        <li>3. প্রতিষ্ঠা সাল: ১৯৮৫ </li>
        <li>
          4. প্রতিষ্ঠাতা: স্থানীয় ভক্তসমাজ (বিশেষত ধর্মপ্রাণ ব্যক্তিবর্গের
          সম্মিলিত উদ্যোগে)
        </li>
      </ul>

      <div className="my-4 space-y-2">
        <h2 className="text-2xl font-semibold">প্রতিষ্ঠার উদ্দেশ্য</h2>
        <p>
          মহানাম যজ্ঞানুষ্ঠান মন্দিরটি মহানাম সংকীর্তন ও যজ্ঞের মাধ্যমে ভগবানের
          সেবা ও সাধনার উদ্দেশ্যে প্রতিষ্ঠিত হয়েছে। এটি প্রাচীন শাস্ত্রসম্মত
          বিধি অনুসরণ করে মহানাম প্রচারের একটি কেন্দ্রস্থল হিসেবে গড়ে উঠেছে।
          মন্দিরটি ভক্তদের সম্মিলিত প্রচেষ্টা ও ঈশ্বরভক্তির মাধ্যমে সরাসরি গঠিত
          হয়েছে।
        </p>
      </div>
      <img src="https://i.ibb.co/RTFsNnqF/22.png" alt="#" />

      <div className="space-y-3 ">
        <h2 className="text-2xl font-semibold">ধর্মীয় কার্যক্রম</h2>
        <p>
          মন্দিরের স্থাপত্যশৈলীতে প্রাচীন ঐতিহ্য ও আধুনিক রুচির সংমিশ্রণ দেখা
          যায়। এখানে প্রতিদিন ভোর থেকে রাত পর্যন্ত বিভিন্ন ধর্মীয় কার্যক্রম
          অনুষ্ঠিত হয়, যেমন:
        </p>
        <ul>
          <li>1. হরিনাম সংকীর্তন </li>
          <li>2. ভগবানের পূজা-অর্চনা </li>
          <li>3. সংস্মৃতিযুক্ত যজ্ঞপাঠ ও ধর্মোপদেশ </li>
        </ul>
      </div>

      <div className="space-y-3 ">
        <h2 className="text-2xl font-semibold"> বিশেষ দিন </h2>
        <p>
          বিশেষ দিনে, যেমন মহানাম যজ্ঞ, জন্মাষ্টমী, দোলপূর্ণিমা, কার্তিক ব্রত,
          এবং ভাগবত সপ্তাহে হাজার হাজার ভক্ত মন্দির প্রাঙ্গণে এসে অংশগ্রহণ করেন।
          তারা ভক্তিসহকারে নাম সংকীর্তন ও প্রসাদ গ্রহণ করেন।
        </p>
      </div>

      <div className="space-y-3 ">
        <h2 className="text-2xl font-semibold"> উপসংহার</h2>
        <p>
          রামপুর আখিরা পাড়া হরিমন্দির কেবল একটি মন্দির নয়; এটি এক জীবন্ত
          আধ্যাত্মিক কেন্দ্র, যেখানে মানুষ ভগবানের প্রেমে একত্রিত হয় এবং নিজেকে
          শুদ্ধ করে তোলে। এই মন্দিরের মাধ্যমে ধর্মীয় ও আধ্যাত্মিক সংস্কৃতির
          ধারাবাহিকতা বজায় থাকে এবং ভক্তদের মধ্যে একতা ও প্রেমের বন্ধন গড়ে
          ওঠে।
              </p>
              <img src="https://i.ibb.co/5WFnqSQG/visual-selection-1.png" alt="#" />
      </div>
    </div>
  );
};

export default Accounts;
